# vsoAppendWidget

## Description
Sets a widget to appear at the end of the widgets in the Object Info Palette.

```pascal
FUNCTION vsoAppendWidget(
				widgetType : LONGINT;
				mappingID  : LONGINT;
				text       : STRING;
				data       : LONGINT) : BOOLEAN;
```

```python

def vs.vsoAppendWidget(widgetType, mappingID, text, data):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetType|LONGINT||
|mappingID|LONGINT||
|text|STRING||
|data|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events